In [5]:
import duckdb
import pandas as pd

PARQUET_PATH = "../../../data/curated/fundamentals/edgar_fundamentals.parquet"

con = duckdb.connect()
df = con.execute(f"SELECT * FROM read_parquet('{PARQUET_PATH}')").df()

df.head()

  symbol      metric  period_end       value period_type  form
0   NVDA  net_income  2017-01-29  1666000000          FY  10-K
1   NVDA  net_income  2017-01-29  1666000000          FY  10-K
2   NVDA  net_income  2017-01-29  1666000000          FY  10-K
3   NVDA  net_income  2017-01-29   655000000          FY  10-K
4   NVDA  net_income  2017-01-29   655000000          FY  10-K

In [6]:
con.execute(f"""
    DESCRIBE SELECT * FROM read_parquet('{PARQUET_PATH}')
""").df()

   column_name column_type null   key default extra
0       symbol     VARCHAR  YES  None    None  None
1       metric     VARCHAR  YES  None    None  None
2   period_end     VARCHAR  YES  None    None  None
3        value      BIGINT  YES  None    None  None
4  period_type     VARCHAR  YES  None    None  None
5         form     VARCHAR  YES  None    None  None